tutorials/jdp-multiRegionTutorial/constant/region1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/region1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    minX
    {
        type            patch;
        nFaces          20;
        startFace       1420;
    }
    maxX
    {
        type            patch;
        nFaces          20;
        startFace       1440;
    }
    minY
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       1460;
    }
    minZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       1760;
    }
    maxZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       1820;
    }
    region1_to_water
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       1880;
        neighbourRegion water;
        neighbourPatch  water_to_region1;
        transformType   none;
    }
)

// ************************************************************************* //
