tutorials/jdp-multiRegionTutorial/0/heater/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    maxY
    {
        type            fixedValue;
        value           uniform 300;
        inletValue      uniform 300;
    }
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    heater_to_water
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
    minY
    {
        type            fixedValue;
        value           uniform 400;
    }
}


// ************************************************************************* //
